mobiaqua/ti-sysbios-c64t/packages/ti/sysbios/family/arm/cc26xx/Power.c
/*
 * Copyright (c) 2014-2015, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQueueNTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/*
 *  ======== Power.c ========
 */

#include <xdc/std.h>
#include <xdc/runtime/Startup.h>
#include <xdc/runtime/Memory.h>
#include <xdc/runtime/Types.h>
#include <xdc/runtime/Error.h>
#include <xdc/runtime/Assert.h>

#include <ti/sysbios/BIOS.h>
#include <ti/sysbios/hal/Hwi.h>
#include <ti/sysbios/knl/Clock.h>
#include <ti/sysbios/knl/Task.h>
#include <ti/sysbios/knl/Swi.h>
#include <ti/sysbios/knl/Queue.h>
#include <ti/sysbios/knl/Intrinsics.h>

#include "PowerCC2650.h"

/* driverlib header files */
#include <inc/hw_types.h>
#include <inc/hw_prcm.h>
#include <inc/hw_nvic.h>
#include <inc/hw_aon_wuc.h>
#include <inc/hw_aon_rtc.h>
#include <inc/hw_memmap.h>
#include <inc/hw_ccfg.h>
#include <driverlib/sys_ctrl.h>
#include <driverlib/pwr_ctrl.h>
#include <driverlib/prcm.h>
#include <driverlib/aon_wuc.h>
#include <driverlib/aon_ioc.h>
#include <driverlib/aon_rtc.h>
#include <driverlib/aon_event.h>
#include <driverlib/aux_wuc.h>
#include <driverlib/osc.h>
#include <driverlib/cpu.h>
#include <driverlib/vims.h>
#include <driverlib/sys_ctrl.h>
#include <driverlib/driverlib_ver.h>

#include "package/internal/Power.xdc.h"

/* bit defines for CUSTOMER_CFG_O_MODE_CONF:SCLK_LF_OPTION */
#define CLK_LF_RCOSC_LF 0xC00000
#define CLK_LF_XOSC_LF  0x800000
#define CLK_LF_XOSC_HF  0x000000

#define SUPPORT_DELAYED_COMPLETE 0

#if ti_sysbios_family_arm_cc26xx_Boot_driverlibVersion == 2
extern void Pg2LeakageWorkaroundStage1(void);
extern void Pg2LeakageWorkaroundStage2(bool bEnterPowerdown);
#endif

extern volatile UInt8 ti_sysbios_family_arm_cc26xx_Power_constraintCounts[
   Power_NUMCONSTRAINTS];

extern UInt ti_sysbios_family_arm_cc26xx_Power_XOSC_HF (UInt action);
extern Bool ti_sysbios_family_arm_cc26xx_Power_isDependencyActive(
    Power_Resource resourceID);

/*
 *  ======== Power_doWFI ========
 */
Void Power_doWFI()
{
    __asm(" wfi");
}

/*
 *  ======== Power_defaultClockFunc ========
 */
Void Power_defaultClockFunc(UArg arg)
{
}

/*
 *  ======== Power_defaultNotifyTrapFunc ========
 */
Void Power_defaultNotifyTrapFunc()
{
    while (1) {};
}

/*
 *  ======== Power_getClockHandle ========
 */
Clock_Handle Power_getClockHandle()
{
    return (Power_Module_State_clockObj());
}

/*
 *  ======== Power_LF_clockFunc ========
 */
Void Power_LF_clockFunc(UArg arg)
{
    UInt32 sourceLF;

     /* query LF clock source */
    sourceLF = OSCClockSourceGet(OSC_SRC_CLK_LF);

    /* is LF source either RCOSC_LF or XOSC_LF yet? */
    if ((sourceLF == OSC_RCOSC_LF) || (sourceLF == OSC_XOSC_LF)) {

        /* yes, disable the LF clock qualifiers */
        DDI16BitfieldWrite(
            AUX_DDI0_OSC_BASE,
            DDI_0_OSC_O_CTL0,
            DDI_0_OSC_CTL0_BYPASS_XOSC_LF_CLK_QUAL_M|
                DDI_0_OSC_CTL0_BYPASS_RCOSC_LF_CLK_QUAL_M,
            DDI_0_OSC_CTL0_BYPASS_RCOSC_LF_CLK_QUAL_S,
            0x3
        );

        /* now finish by releasing the standby disallow constraint */
        Power_releaseConstraint(Power_SB_DISALLOW);
    }

    /* not yet, LF still derived from HF, restart clock to check back later */
    else {
        /* retrigger LF Clock to fire in 100 msec */
        Clock_setTimeout(
            ti_sysbios_family_arm_cc26xx_Power_Module_State_lfClockObj(),
            (100000 / Clock_tickPeriod));
        Clock_start(
            ti_sysbios_family_arm_cc26xx_Power_Module_State_lfClockObj());
    }
}

/*
 *  ======== Power_Module_startup ========
 */
Int ti_sysbios_family_arm_cc26xx_Power_Module_startup(Int status)
{
    DRIVERLIB_ASSERT_CURR_VERSION();

    /* enable cache (in case boot ROM doesn't because of HIB) */
    HWREG(VIMS_BASE + VIMS_O_CTL) = ((HWREG(VIMS_BASE + VIMS_O_CTL) &
        ~VIMS_CTL_MODE_M ) | VIMS_CTL_MODE_CACHE );

    /* force AUX on and enable OSC clock */
    OSCInterfaceEnable();

    /* source the HF clock from RC_OSC */
    OSCHF_SwitchToRcOscTurnOffXosc();

    /* when in sleep, power off JTAG */
    AONWUCJtagPowerOff();

    /* allow AUX to power down */
    AUXWUCPowerCtrl(AUX_WUC_POWER_DOWN);

    /* clear PDCTL1.VIMS_MODE to power VIMS only when CPU domain is powered */
    HWREG(PRCM_BASE + PRCM_O_PDCTL1VIMS) &= ~PRCM_PDCTL1VIMS_ON;

    /* sync with AON */
    SysCtrlAonSync();

    /* set standby disallow constraint pending LF clock quailifier disabling */
    Power_setConstraint(Power_SB_DISALLOW);

    return (Startup_DONE);
}

/*
 *  ======== Power_getConstraintInfo ========
 *  Get a bitmask indicating the constraints that have been registered with
 *  Power.
 */
UInt32 Power_getConstraintInfo(Void)
{
    return (Power_module->constraintsMask);
}

