mobiaqua/ti-sysbios-c64t/packages/ti/sysbios/family/arm/cc26xx/Power.c
            /* setup sleep vars */
            if (sleepState == Power_STANDBY) {
                preEvent = Power_ENTERING_STANDBY;
                postEvent = Power_AWAKE_STANDBY;
                postEventLate = Power_AWAKE_STANDBY_LATE;
            }

            /* disable Task scheduling; allow Swis and Hwis for notifications */
            taskKey = Task_disable();

            /* signal all clients registered for pre-sleep notification */
            status = Power_notify(preEvent);

            /* check for any error */
            if (status != Power_SOK) {
                Power_module->state = Power_ACTIVE;
                Task_restore(taskKey);          /* re-enable scheduler */
                return (status);
            }

            /* now disable Swi scheduling */
            swiKey = Swi_disable();

            /* freeze the IOs on the boundary between MCU and AON */
            AONIOCFreezeEnable();

            /* if XOSC_HF is active, force it off */
            if(OSCClockSourceGet(OSC_SRC_CLK_HF) == OSC_XOSC_HF) {
                xosc_hf_active = TRUE;
                ti_sysbios_family_arm_cc26xx_Power_XOSC_HF(DISABLE);
            }

            /* allow AUX to power down */
            AONWUCAuxWakeupEvent(AONWUC_AUX_ALLOW_SLEEP);

            /* make sure writes take effect */
            SysCtrlAonSync();

            /* invoke specific sequences to activate sleep states... */

            if (sleepState == Power_STANDBY) {

                /* query and save domain states before powering them off */
                if (Power_getDependencyCount(DOMAIN_RFCORE)) {
                    poweredDomains |= PRCM_DOMAIN_RFCORE;
                }
                if (Power_getDependencyCount(DOMAIN_SERIAL)){
                    poweredDomains |= PRCM_DOMAIN_SERIAL;
                }
                if (Power_getDependencyCount(DOMAIN_PERIPH)) {
                    poweredDomains |= PRCM_DOMAIN_PERIPH;
                }
#if ti_sysbios_family_arm_cc26xx_Boot_driverlibVersion == 1
                if (Power_getDependencyCount(DOMAIN_SYSBUS)) {
                    poweredDomains |= PRCM_DOMAIN_SYSBUS;
                }
#endif

                /* gate running deep sleep clocks for Crypto and DMA */
                if (Power_getDependencyCount(PERIPH_CRYPTO)) {
                    PRCMPeripheralDeepSleepDisable(
                        ti_sysbios_family_arm_cc26xx_Power_db[
                            PERIPH_CRYPTO].driverlibID);
                }
                if (Power_getDependencyCount(PERIPH_UDMA)) {
                    PRCMPeripheralDeepSleepDisable(
                        ti_sysbios_family_arm_cc26xx_Power_db[
                            PERIPH_UDMA].driverlibID);
                }
                /* make sure clock settings take effect */
                PRCMLoadSet();

                /* request power off of domains in the MCU voltage domain */
                PRCMPowerDomainOff(poweredDomains | PRCM_DOMAIN_CPU);

#if ti_sysbios_family_arm_cc26xx_Boot_driverlibVersion == 2
                if (Power_enableVCOLDOPG2 == TRUE) {
                    Pg2LeakageWorkaroundStage1();
                }
#endif

                /* request uLDO during standby */
                PRCMMcuUldoConfigure(true);

                /* query constraints to determine if cache should be retained */
                constraints = Power_getConstraintInfo();
                if ((constraints & Power_SB_VIMS_CACHE_RETAIN) != 0) {
                    retainCache = TRUE;
                }

                /* if don't want retention in standby, disable it now ... */
                if (retainCache == FALSE) {
                    modeVIMS = VIMSModeGet(VIMS_BASE);
                    /* wait if invalidate in progress... */
                    while (modeVIMS == VIMS_MODE_INVALIDATE) {
                        modeVIMS = VIMSModeGet(VIMS_BASE);
                    }
                    PRCMRetentionDisable(PRCM_DOMAIN_VIMS);
                    VIMSModeSet(VIMS_BASE, VIMS_MODE_OFF);
                }

                /* setup recharge parameters */
                SysCtrlSetRechargeBeforePowerDown(XoscInHighPowerMode);

                /* make sure all writes have taken effect */
                SysCtrlAonSync();

#if ti_sysbios_family_arm_cc26xx_Boot_driverlibVersion == 2
                if (Power_enableVCOLDOPG2 == TRUE) {
                    Pg2LeakageWorkaroundStage2(true);

                    /* wait to ensure RFCORE is off before deep sleep */
                    while (PRCMPowerDomainStatus(PRCM_DOMAIN_RFCORE) !=
                        PRCM_DOMAIN_POWER_OFF){};
                }
#endif

                /* invoke deep sleep to go to STANDBY */
                PRCMDeepSleep();

#if ti_sysbios_family_arm_cc26xx_Boot_driverlibVersion == 2
                if (Power_enableVCOLDOPG2 == TRUE) {
                    Pg2LeakageWorkaroundStage1();
                }
#endif

                /* if didn't retain cache in standby, re-enable retention now */
                if (retainCache == FALSE) {
                    VIMSModeSet(VIMS_BASE, modeVIMS);
                    PRCMRetentionEnable(PRCM_DOMAIN_VIMS);
                }

                /* force power on of AUX to keep it on when system is not
                 * sleeping; this also counts as a write to the AON interface
                 * ensuring that a following sync of the AON interface will
                 * force an update of all registers
                 */
                AONWUCAuxWakeupEvent(AONWUC_AUX_WAKEUP);
                while(!(AONWUCPowerStatus() & AONWUC_AUX_POWER_ON)) {};

                /* if XOSC_HF was forced off above, initiate switch back */
                if (xosc_hf_active == TRUE) {
                    ti_sysbios_family_arm_cc26xx_Power_XOSC_HF(ENABLE);
                }

#if ti_sysbios_family_arm_cc26xx_Boot_driverlibVersion == 2
                if (Power_enableVCOLDOPG2 == TRUE) {
                    /* restore power domain states, excluding RFCORE */
                    PRCMPowerDomainOn(poweredDomains & (~PRCM_DOMAIN_RFCORE));
                    while (PRCMPowerDomainStatus(poweredDomains &
                                                 (~PRCM_DOMAIN_RFCORE)) !=
                        PRCM_DOMAIN_POWER_ON){};
                }
                else {
                    /* restore power domain states in effect before standby */
                    PRCMPowerDomainOn(poweredDomains);
                    while (PRCMPowerDomainStatus(poweredDomains) !=
                        PRCM_DOMAIN_POWER_ON){};
                }
#else
                /* restore power domain states in effect before standby */
                PRCMPowerDomainOn(poweredDomains);
                while (PRCMPowerDomainStatus(poweredDomains) !=
                    PRCM_DOMAIN_POWER_ON){};
#endif

                /* restore deep sleep clocks of Crypto and DMA */
                if (Power_getDependencyCount(PERIPH_CRYPTO)) {
                    PRCMPeripheralDeepSleepEnable(
                        ti_sysbios_family_arm_cc26xx_Power_db[
                            PERIPH_CRYPTO].driverlibID);
                }
                if (Power_getDependencyCount(PERIPH_UDMA)) {
                    PRCMPeripheralDeepSleepEnable(
                        ti_sysbios_family_arm_cc26xx_Power_db[
                            PERIPH_UDMA].driverlibID);
                }
                /* make sure clock settings take effect */
                PRCMLoadSet();
            }

            /* release request for uLDO */
            PRCMMcuUldoConfigure(false);

            /* set transition state to EXITING_SLEEP */
            Power_module->state = Power_EXITING_SLEEP;

#if ti_sysbios_family_arm_cc26xx_Boot_driverlibVersion == 1
            /* disable edge detection interrupt since the latches will prevent
               clearing of the event source */
            /* NB - this is a PG1 workaround */
            edgeKey = Hwi_disableInterrupt(INT_EDGE_DETECT);
#endif

