mobiaqua/ti-sysbios-c64t/packages/ti/sysbios/family/arm/cc26xx/Power.c
            /* wait for power on AUX - this could be moved to after servicing
             * interrupt if we are absolutely sure that the oscillator
             * interface is NOT accesses in interrupt context
             */
            while(!(AONWUCPowerStatus() & AONWUC_AUX_POWER_ON))
            { }

#if ti_sysbios_family_arm_cc26xx_Boot_driverlibVersion == 2
            if (Power_enableVCOLDOPG2 == TRUE) {
                Pg2LeakageWorkaroundStage2(false);

                /* if it was powered upon entry, turn back on the RF CORE */
                if (poweredDomains & PRCM_DOMAIN_RFCORE) {
                    PRCMPowerDomainOn(PRCM_DOMAIN_RFCORE);
                    while (PRCMPowerDomainStatus(PRCM_DOMAIN_RFCORE) !=
                        PRCM_DOMAIN_POWER_ON){};
                }
            }
#endif

            /*
             * signal clients registered for early post-sleep notification;
             * this should be used to initialize any timing critical or IO
             * dependent hardware
             */
            status = Power_notify(postEvent);

            /* disable IO freeze and ensure RTC shadow value is updated */
            AONIOCFreezeDisable();
            SysCtrlAonSync();

            /* re-enable interrupts */
            CPUcpsie();

#if ti_sysbios_family_arm_cc26xx_Boot_driverlibVersion == 1
            /* restore edge detection interrupts - IO event flags can now be
               cleared */
            /* NB - this is a PG1 workaround */
            Hwi_restoreInterrupt(INT_EDGE_DETECT, edgeKey);
#endif
            /* signal all clients registered for late post-sleep notification */
            status = Power_notify(postEventLate);

            /* now clear the transition state before re-enabling scheduler */
            Power_module->state = Power_ACTIVE;

            /* re-enable Swi scheduling */
            Swi_restore(swiKey);

            /* adjust recharge parameters */
            SysCtrlAdjustRechargeAfterPowerDown();

            /* re-enable Task scheduling */
            Task_restore(taskKey);

            /* check for any notification error */
            if (status != Power_SOK) {
                return (status);
            }
        }
    }

    return (status);
}

/*
 *  ======== Power_switchXOSC_HF ========
 *  Switch to enable XOSC_HF.
 *
 */
Void Power_switchXOSC_HF(Void)
{
    UInt key;

    key = Hwi_disable();

    /* only switch source if there is a pending change */
    if (Power_module->xoscPending == TRUE) {
        OSCHF_AttemptToSwitchToXosc();
        Power_module->xoscPending = FALSE;
    }

    Hwi_restore(key);
}

/*
 *  ======== Power_unregisterNotify ========
 *  Unregister for a power notification.
 *
 */
Void Power_unregisterNotify(Power_NotifyObj * pNotifyObj)
{
    UInt key;

    /* remove notify object from its event queue */
    key = Hwi_disable();
    Queue_remove((Queue_Elem *)pNotifyObj);
    Hwi_restore(key);
}


/* * * * * * * * * * * * internal support functions * * * * * * * * * * * */


/*
 *  ======== Power_notify ========
 *
 *  Note: When this function is called Task scheduling is disabled.
 */
Power_Status Power_notify(Power_Event eventType)
{
    Power_Status returnStatus = Power_SOK;
    Power_NotifyResponse notifyStatus;
    Queue_Handle notifyQ;

    notifyQ = Power_Module_State_notifyQ();

    /* if notification queue is not empty, service the queue */
    if (!Queue_empty(notifyQ)) {

       /* service the notification queue... */
       notifyStatus = Power_serviceNotifyQ(eventType);

       /* if notifications did not complete successfully ... */
        if (notifyStatus != Power_NOTIFYDONE) {

            /* call the configured notify trap function */
            (*(Power_FuncPtr)Power_notifyTrapFunc)();

            returnStatus = Power_EFAIL;
        }
    }

    return (returnStatus);
}

/*
 *  ======== Power_serviceNotifyQ ========
 *
 */
Power_NotifyResponse Power_serviceNotifyQ(Power_Event eventType)
{
    Power_NotifyResponse returnStatus = Power_NOTIFYDONE;
    Power_NotifyResponse clientStatus;
    Queue_Handle notifyQ;
    Queue_Elem * elem;
    Fxn notifyFxn;
    UArg clientArg;

    notifyQ = Power_Module_State_notifyQ();

    /* point to first client notify object */
    elem = Queue_head(notifyQ);

    /* walk the queue and notify each registered client of the event */
    do {
        if (((Power_NotifyObj *)elem)->eventTypes & eventType) {

            /* pull params from notify object */
            notifyFxn = ((Power_NotifyObj *)elem)->notifyFxn;
            clientArg = ((Power_NotifyObj *)elem)->clientArg;

            /* call the client's notification function */
            clientStatus = (Power_NotifyResponse) (*(Fxn)notifyFxn)(
                eventType, clientArg);

            /* if client declared error stop all further notifications */
            if (clientStatus == Power_NOTIFYERROR) {
                return (Power_NOTIFYERROR);
            }
        }

        /* get next element in the notification queue */
        elem = Queue_next(elem);

    } while (elem != (Queue_Elem *) notifyQ);

    return (returnStatus);
}
